test_carga/artillery.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 14:29:48(-0400)

Phase completed: unnamed (index: 0, duration: 1s) 14:29:50(-0400)

All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 14:29:53(-0400)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 173/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 472
  median: ...................................................................... 67.4
  p95: ......................................................................... 368.8
  p99: ......................................................................... 468.8
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 444.7
  max: ......................................................................... 2350.1
  median: ...................................................................... 2101.1
  p95: ......................................................................... 2322.1
  p99: ......................................................................... 2322.1